Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementOperation
Analysis change management operation.

Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementOperation.Operation
Operation type.

Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementOperation.AnalysisModelName
The name of the analysis model.

Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementOperation.ObjectId
Object identifier.

Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementOperation.ObjectId2
Object2 identifier.

Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementOperation.DiffType
Difference type.

Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementOperation.PositionIndex
Position index.

Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementOperation.Status
Status true/false.

Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementOperation.ResetMode
Reset mode.

Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementOperation.Automation
Automation true/false.

Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementOperation.AnalysisClass
Analysis class.